In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
person={
    'first':['chicken','jane','michal'],
    'last':['murga','ban','roy'],
    'email':['chicken123@gmail.com','jane23@email.com','roy253@gmail.com']
}
df=pd.DataFrame(person,index=['one','two','three'])
df

         first   last                 email
one    chicken  murga  chicken123@gmail.com
two       jane    ban      jane23@email.com
three   michal    roy      roy253@gmail.com

In [2]:
df['email']

one      chicken123@gmail.com
two          jane23@email.com
three        roy253@gmail.com
Name: email, dtype: object

# Adding a Series and DataFrame

In [3]:
#series
x=pd.Series({'email':'kpbaa14@gmail.com','first':'kp','last':'oli'},name='four')
print(x)

email    kpbaa14@gmail.com
first                   kp
last                   oli
Name: four, dtype: object

In [4]:
final=df.append(x)
final

         first   last                 email
one    chicken  murga  chicken123@gmail.com
two       jane    ban      jane23@email.com
three   michal    roy      roy253@gmail.com
four        kp    oli     kpbaa14@gmail.com

In [5]:
# final=df.append(x,ignore_index=True)
# final

In [6]:
type(final['first'])

pandas.core.series.Series

In [7]:
new=pd.Series({'email':'xyz12@email.com','first':'xyz','last':'bell'},name='four')
new

email    xyz12@email.com
first                xyz
last                bell
Name: four, dtype: object

In [8]:
final1=final.append(new)
final1

         first   last                 email
one    chicken  murga  chicken123@gmail.com
two       jane    ban      jane23@email.com
three   michal    roy      roy253@gmail.com
four        kp    oli     kpbaa14@gmail.com
four       xyz   bell       xyz12@email.com

In [9]:
final1.index

Index(['one', 'two', 'three', 'four', 'four'], dtype='object')

In [10]:
final1.loc['four']

     first  last              email
four    kp   oli  kpbaa14@gmail.com
four   xyz  bell    xyz12@email.com

In [11]:
final.iloc[3]

first                   kp
last                   oli
email    kpbaa14@gmail.com
Name: four, dtype: object

In [12]:
final1

         first   last                 email
one    chicken  murga  chicken123@gmail.com
two       jane    ban      jane23@email.com
three   michal    roy      roy253@gmail.com
four        kp    oli     kpbaa14@gmail.com
four       xyz   bell       xyz12@email.com

In [13]:
#creating a new dataframe
df1=pd.DataFrame({
    'email':['','',''],
    'first':['A','B','X'],
    'last':['a','b','x'],
    'age':['','','']
})
print(df1)

  email first last age
0           A    a
1           B    b
2           X    x

In [14]:
final1=final1.append(df1)
final1

         first   last                 email  age
one    chicken  murga  chicken123@gmail.com  NaN
two       jane    ban      jane23@email.com  NaN
three   michal    roy      roy253@gmail.com  NaN
four        kp    oli     kpbaa14@gmail.com  NaN
four       xyz   bell       xyz12@email.com  NaN
0            A      a
1            B      b
2            X      x

In [15]:
final1.iloc[1]

first                jane
last                  ban
email    jane23@email.com
age                   NaN
Name: two, dtype: object

In [16]:
final1.loc[1]

first    B
last     b
email
age
Name: 1, dtype: object

In [17]:
final1.index

Index(['one', 'two', 'three', 'four', 'four', 0, 1, 2], dtype='object')

In [18]:
final1.index.duplicated()

array([False, False, False, False,  True, False, False, False])

In [19]:
#reset the index name
final11=final1.rename(index={0:'new zero',1:'new one',2:'new two'})
final11

            first   last                 email  age
one       chicken  murga  chicken123@gmail.com  NaN
two          jane    ban      jane23@email.com  NaN
three      michal    roy      roy253@gmail.com  NaN
four           kp    oli     kpbaa14@gmail.com  NaN
four          xyz   bell       xyz12@email.com  NaN
new zero        A      a
new one         B      b
new two         X      x

In [20]:
final1.index

Index(['one', 'two', 'three', 'four', 'four', 0, 1, 2], dtype='object')

In [21]:
final11.index

Index(['one', 'two', 'three', 'four', 'four', 'new zero', 'new one',
       'new two'],
      dtype='object')

In [84]:
#reset index
final11.reset_index(inplace=True)
final11

      index    first   last                 email  age
0       one  chicken  murga  chicken123@gmail.com  NaN
1       two     jane    ban      jane23@email.com  NaN
2     three   michal    roy      roy253@gmail.com  NaN
3      four       kp    oli     kpbaa14@gmail.com  NaN
4      four      xyz   bell       xyz12@email.com  NaN
5  new zero        A      a
6   new one        B      b
7   new two        X      x

In [55]:
#drop na vaue.
final11.dropna()
#final11.dropna(axis=0,subset=['email'])

         first  last email   age
four      five  five  five  five
new zero     A     a
new one      B     b
new two      X     x

In [63]:
final11.drop_duplicates(subset=['age'],inplace=True)

In [64]:
final11

            first   last                 email   age
one       chicken  murga  chicken123@gmail.com   NaN
four         five   five                  five  five
new zero        A      a

In [67]:
final11.fillna(0)

            first   last                 email   age
one       chicken  murga  chicken123@gmail.com     0
four         five   five                  five  five
new zero        A      a